Tekla Open API Reference for Tekla Structures 2025
EmbeddedObjectBase.Attributes Property
 Gets or sets the attributes.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public EmbeddedObjectAttributes Attributes { get; set; }
Public Property Attributes As EmbeddedObjectAttributes
	Get
	Set
Property Value
Type: EmbeddedObjectAttributes
See Also
Reference
EmbeddedObjectBase Class
Tekla.Structures.Drawing Namespace